Ran Apply for project: `github` dir: `apps/github` workspace: `github`

<details><summary>Show Output</summary>

```diff
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/elxilote/github/runs/run-XNfPZEnCFpakd35D

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
github_actions_secret.telegram_to: Refreshing state... [id=ansible_playbooks:TELEGRAM_TO]
github_actions_secret.dockerhub_token["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
github_actions_secret.telegram_chat: Refreshing state... [id=ansible_playbooks:TELEGRAM_TOKEN]
github_actions_secret.dockerhub_token["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_TOKEN]
data.github_actions_public_key.twitch-bot: Refreshing...
data.github_actions_public_key.ansible_playbooks: Refreshing...
github_actions_secret.dockerhub_username["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_username["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_USERNAME]
github_repository.repo["chef"]: Refreshing state... [id=chef]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["api-go-templ"]: Refreshing state... [id=api-go-templ]
github_repository.repo["dotfiles-nix"]: Refreshing state... [id=dotfiles-nix]
data.github_actions_public_key.twitch-bot: Refresh complete after 0s [id=3380204578043523366]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["deckmaster-config"]: Refreshing state... [id=deckmaster-config]
data.github_actions_public_key.ansible_playbooks: Refresh complete after 0s [id=3380204578043523366]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["obs-wiki"]: Refreshing state... [id=obs-wiki]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_repository.repo["obs-go-cli"]: Refreshing state... [id=obs-go-cli]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_repository.repo["twitch-bot"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["meal-notifier"]: Drift detected (update)
github_repository.repo["api-go-templ"]: Drift detected (update)
github_repository.repo["obs-go-cli"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["obs-wiki"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.repo["api-go-otel-fuego"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "api-go-otel-fuego"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "homelab",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.repo["api-go-templ"] will be destroyed
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"efafd92fa76127e6899d4d9009954fc03c0253a0dc5777359019f5d1b32889a2\"" -> null
      - full_name                   = "mvaldes14/api-go-otel-fuego" -> null
      - git_clone_url               = "git://github.com/mvaldes14/api-go-otel-fuego.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/api-go-otel-fuego" -> null
      - http_clone_url              = "https://github.com/mvaldes14/api-go-otel-fuego.git" -> null
      - id                          = "api-go-templ" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "api-go-templ" -> null
      - node_id                     = "R_kgDOK81QYQ" -> null
      - primary_language            = "Nix" -> null
      - private                     = false -> null
      - repo_id                     = 734875745 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/api-go-otel-fuego.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/api-go-otel-fuego" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

github_repository.repo["api-go-templ"]: Destroying... [id=api-go-templ]
github_repository.repo["api-go-otel-fuego"]: Creating...
github_repository.repo["api-go-templ"]: Destruction complete after 2s
github_repository.repo["api-go-otel-fuego"]: Still creating... [10s elapsed]
github_repository.repo["api-go-otel-fuego"]: Creation complete after 12s [id=api-go-otel-fuego]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

</details>